In [1]:
# Импортируем Pandas
import pandas as pd
# ипортируем Numpy 
import numpy as np

In [4]:
# Задаем количество записей
N = 10

Nrow = np.arange(1, N+1) # номер записи
Name = ['Сотрудник ' + str(i) for i in range(1, N+1)] # имя сотрудника
BirthYear = np.random.randint(1965, 1990+1, size=N) # год рождения
EmployYear = np.random.randint(BirthYear+18, 2007, size=N) # год приема на работу
Salary = np.random.randint(10000, 30000+1, size=N) # зарплата

df = pd.DataFrame({'Nrow': Nrow,
                   'Name': Name,
                   'BirthYear': BirthYear,
                   'EmployYear': EmployYear,
                   'Salary': Salary})

# Выводим фрейм данных
df

   Nrow          Name  BirthYear  EmployYear  Salary
0     1   Сотрудник 1       1968        1999   20365
1     2   Сотрудник 2       1980        2001   23182
2     3   Сотрудник 3       1977        2002   11299
3     4   Сотрудник 4       1988        2006   23971
4     5   Сотрудник 5       1987        2006   25676
5     6   Сотрудник 6       1984        2002   28786
6     7   Сотрудник 7       1981        1999   23119
7     8   Сотрудник 8       1985        2003   29610
8     9   Сотрудник 9       1972        2004   23119
9    10  Сотрудник 10       1981        2006   12783

In [6]:
(df['Salary'] > 15000).value_counts()[True] # Число сотрудников с зарплатой, больше 15000

8

In [8]:
df['income_tax'] = df['Salary'] * 0.13
df['income_tax_sum'] = (df['Salary'] * 0.13) * (2023 - df['EmployYear'])
df

,Nrow,Name,BirthYear,EmployYear,Salary,income_tax,income_tax_sum
0,1,Сотрудник 1,1968,1999,20365,2647.45,63538.80
1,2,Сотрудник 2,1980,2001,23182,3013.66,66300.52
2,3,Сотрудник 3,1977,2002,11299,1468.87,30846.27
3,4,Сотрудник 4,1988,2006,23971,3116.23,52975.91
4,5,Сотрудник 5,1987,2006,25676,3337.88,56743.96
5,6,Сотрудник 6,1984,2002,28786,3742.18,78585.78
6,7,Сотрудник 7,1981,1999,23119,3005.47,72131.28
7,8,Сотрудник 8,1985,2003,29610,3849.30,76986.00
8,9,Сотрудник 9,1972,2004,23119,3005.47,57103.93
9,10,Сотрудник 10,1981,2006,12783,1661.79,28250.43